# 데이터 연결하기
## 1. concat 메서드로 데이터연결하기

In [1]:
import os
os.getcwd()

'C:\\SeSAC\\python-study_sourcetree\\Book_doit_JumpToPython'

In [2]:
import pandas as pd
df1 = pd.read_csv('data/concat_1.csv')
df2 = pd.read_csv('data/concat_2.csv')
df3 = pd.read_csv('data/concat_3.csv')

In [8]:
print(df1)
print(df2)
print(df3)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7
     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [5]:
row_concat = pd.concat([df1, df2, df3])

In [10]:
row_concat.head()

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  a4  b4  c4  d4

In [15]:
row_concat.iloc[3,] # 4번째 행 추출

A    a3
B    b3
C    c3
D    d3
Name: 3, dtype: object

## 2. 데이터프레임에 시리즈 연결하기
- 속성(attribute)이 없기때문에 새로운 열에 추가한다.
- concat
    - 2개 이상의 데이터를 가진 dataframe을 연결
- append
    - 1개의 데이터를 가진 dataframe을 연결

    - attribute가 있어서 행에 추가됨

In [16]:
new_row_series = pd.Series(['n1','n2','n3','n4']) 
new_row_series

0    n1
1    n2
2    n3
3    n4
dtype: object

In [17]:
print(pd.concat([df1, new_row_series]))

     A    B    C    D    0
0   a0   b0   c0   d0  NaN
1   a1   b1   c1   d1  NaN
2   a2   b2   c2   d2  NaN
3   a3   b3   c3   d3  NaN
0  NaN  NaN  NaN  NaN   n1
1  NaN  NaN  NaN  NaN   n2
2  NaN  NaN  NaN  NaN   n3
3  NaN  NaN  NaN  NaN   n4

    - attribute가 있어서 행에 추가됨

In [26]:
new_row_df = pd.DataFrame([['n1','n2','n3','n4']]
                         ,columns=['A','B','C','D'])
print(new_row_df)
print('------------------')
print(pd.concat([df1, new_row_df]))

    A   B   C   D
0  n1  n2  n3  n4
------------------
    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

    - append 이용

In [29]:
print(df1.append([new_row_df]))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
0  n1  n2  n3  n4

In [33]:
# 기존 인덱스를 사용할지 여부. False의경우 0,1,2,..n이 부여된다.
# ignore_index = True 는 인덱스를 없앤다.
data_dict = {
    'A': 'n1'
    ,'B': 'n2'
    ,'C': 'n3'
    ,'D': 'n4'
}
print(df1.append(data_dict,ignore_index=True))

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  n1  n2  n3  n4

## 3. 다양한 방법으로 데이터 연결하기 
- ignore_index
    - 자기가 가진 인덱스를 없애려면 ignore_index=True를 파라미터에 넣는다.

In [45]:
# 각자 인덱스 유지
row_concat_i = pd.concat([df1, df2, df3], ignore_index=False) 
print(row_concat_i)
print('------------------')
# 각자 인덱스 무시
row_concat_i = pd.concat([df1, df2, df3], ignore_index=True) 
print(row_concat_i)
print('------------------')
# 열 배열, 인덱스 무시
row_concat_i = pd.concat([df1, df2, df3], axis=1, ignore_index=True) 
print(row_concat_i)

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11
------------------
      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11
------------------
    0   1   2   3   4   5   6   7    8    9   10   11
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

## 4. 열 방향으로 데이터 연결하기

In [41]:
col_concat = pd.concat([df1, df2, df3], axis=1) # 기본값은0
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [43]:
# 열 이름이 'A'인 것들 추출
print(col_concat['A',])

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [44]:
col_concat['new_col_list'] = ['n1','n2','n3','n4']
print(col_concat)

    A   B   C   D   A   B   C   D    A    B    C    D new_col_list
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8           n1
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9           n2
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10           n3
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11           n4

## 5. 공통 열과 공통 인덱스만 연결하기

In [47]:
df1.columns = ['A','B','C','D']
df2.columns = ['E','F','G','H']
df3.columns = ['A','C','F','H']
print(df1)
type(df1)

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

pandas.core.frame.DataFrame

In [48]:
print(df2)
type(df1)

    E   F   G   H
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

pandas.core.frame.DataFrame

In [73]:
# sort=False 해줘야 FutureWarning안난다
import warnings
warnings.simplefilter(action="ignore",category=FutureWarning)
print(pd.concat([df1,df2,df3]))

     A    B    C    D    E    F    G    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN
0  NaN  NaN  NaN  NaN   a4   b4   c4   d4
1  NaN  NaN  NaN  NaN   a5   b5   c5   d5
2  NaN  NaN  NaN  NaN   a6   b6   c6   d6
3  NaN  NaN  NaN  NaN   a7   b7   c7   d7
0   a8  NaN   b8  NaN  NaN   c8  NaN   d8
1   a9  NaN   b9  NaN  NaN   c9  NaN   d9
2  a10  NaN  b10  NaN  NaN  c10  NaN  d10
3  a11  NaN  b11  NaN  NaN  c11  NaN  d11

In [74]:
# 3개 dataframe의 공통되는 열이 없다.
print(pd.concat([df1,df2,df3],join='inner'))

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]

In [75]:
print(pd.concat([df1,df3],join='inner'))

     A    C
0   a0   c0
1   a1   c1
2   a2   c2
3   a3   c3
0   a8   b8
1   a9   b9
2  a10  b10
3  a11  b11

In [81]:
df1.index=[0,1,2,3]
df2.index=[4,5,6,7]
df3.index=[0,2,4,6]
df3

     A    C    F    H
0   a8   b8   c8   d8
2   a9   b9   c9   d9
4  a10  b10  c10  d10
6  a11  b11  c11  d11

In [92]:
# axis=1 열을 따라 동작한다
col_concat = pd.concat([df1,df2,df3],axis=1)
col_concat

     A    B    C    D    E    F    G    H    A    C    F    H
0   a0   b0   c0   d0  NaN  NaN  NaN  NaN   a8   b8   c8   d8
1   a1   b1   c1   d1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2   a2   b2   c2   d2  NaN  NaN  NaN  NaN   a9   b9   c9   d9
3   a3   b3   c3   d3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   a4   b4   c4   d4  a10  b10  c10  d10
5  NaN  NaN  NaN  NaN   a5   b5   c5   d5  NaN  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN   a6   b6   c6   d6  a11  b11  c11  d11
7  NaN  NaN  NaN  NaN   a7   b7   c7   d7  NaN  NaN  NaN  NaN

In [86]:
# df1, df3 공통 행만 연결
print(pd.concat([df1,df3], axis=1, join='inner'))

    A   B   C   D   A   C   F   H
0  a0  b0  c0  d0  a8  b8  c8  d8
2  a2  b2  c2  d2  a9  b9  c9  d9

## 6. merge 메서드 사용하기
### 연결 전용 메서드

- 기준열 이름이 같을 때
    - pd.merge(left, right, on = '기준열', how = '조인방식')

- 기준열 이름이 다를 때
    - pd.merge(left, right, left_on = '왼쪽 열', right_on = '오른쪽 열', how = '조인방식')
    
left : 왼쪽 데이터프레임<br/>
right : 오른쪽 데이터프레임<br/>
on : (두 데이터프레임의 기준열 이름이 같을 때) 기준열<br/>
how : 조인 방식 {'left', 'right', 'inner', 'outer'} 기본값은 'inner'<br/>

left_on : 기준열 이름이 다를 때, 왼쪽 기준열<br/>
right_on : 기준열 이름이 다를 때, 오른쪽 기준열<br/>

In [101]:
# csv다운
person = pd.read_csv('data/survey_person.csv')
site = pd.read_csv('data/survey_site.csv')
visited = pd.read_csv('data/survey_visited.csv')
survey = pd.read_csv('data/survey_survey.csv')

In [105]:
visited

   ident   site       dated
0    619   DR-1  1927-02-08
1    622   DR-1  1927-02-10
2    734   DR-3  1939-01-07
3    735   DR-3  1930-01-12
4    751   DR-3  1930-02-26
5    752   DR-3         NaN
6    837  MSK-4  1932-01-14
7    844   DR-1  1932-03-22

In [117]:
survey

    taken person quant  reading
0     619   dyer   rad     9.82
1     619   dyer   sal     0.13
2     622   dyer   rad     7.80
3     622   dyer   sal     0.09
4     734     pb   rad     8.41
5     734   lake   sal     0.05
6     734     pb  temp   -21.50
7     735     pb   rad     7.22
8     735    NaN   sal     0.06
9     735    NaN  temp   -26.00
10    751     pb   rad     4.35
11    751     pb  temp   -18.50
12    751   lake   sal     0.10
13    752   lake   rad     2.19
14    752   lake   sal     0.09
15    752   lake  temp   -16.00
16    752    roe   sal    41.60
17    837   lake   rad     1.46
18    837   lake   sal     0.21
19    837    roe   sal    22.50
20    844    roe   rad    11.25

In [103]:
visited_subset = visited.loc[[0,2,6], ]
visited_subset

   ident   site       dated
0    619   DR-1  1927-02-08
2    734   DR-3  1939-01-07
6    837  MSK-4  1932-01-14

#### merge 연습

In [121]:
# merge연습
o2o_merge = site.merge(visited_subset, left_on='name',right_on='site')
print(o2o_merge)

    name    lat    long  ident   site       dated
0   DR-1 -49.85 -128.57    619   DR-1  1927-02-08
1   DR-3 -47.15 -126.72    734   DR-3  1939-01-07
2  MSK-4 -48.87 -123.40    837  MSK-4  1932-01-14

In [126]:
print(person.head(3))
print()
print(survey.head(3))

  ident  personal   family
0  dyer   William     Dyer
1    pb     Frank  Pabodie
2  lake  Anderson     Lake

   taken person quant  reading
0    619   dyer   rad     9.82
1    619   dyer   sal     0.13
2    622   dyer   rad     7.80

In [134]:
# person.merge(visited_subset, left_on='name',right_on='site')
ps = person.merge(survey, left_on='ident',right_on='person')
vs = visited.merge(survey, left_on='ident',right_on='taken')
ps.shape # 19x7
vs.shape # 21x7

(21, 7)

In [127]:
vs.head(5)

   ident  site       dated  taken person quant  reading
0    619  DR-1  1927-02-08    619   dyer   rad     9.82
1    619  DR-1  1927-02-08    619   dyer   sal     0.13
2    622  DR-1  1927-02-10    622   dyer   rad     7.80
3    622  DR-1  1927-02-10    622   dyer   sal     0.09
4    734  DR-3  1939-01-07    734     pb   rad     8.41

In [136]:
'''
ps df의 ident, taken, quant, reading 열의 값과
vs df의 person, ident, quant, reading 열의 값을
이용하여 ps와 vs df을 연결
'''
ps_vs = ps.merge(vs, left_on=['ident', 'taken', 'quant', 'reading']
                    ,right_on=['person', 'ident', 'quant', 'reading'])

print(ps_vs) # 18개 나옴. inner조인으로 속성4개의 값이 같은게 데이터가 18개가 있다는거네

   ident_x   personal   family  taken_x person_x quant  reading  ident_y  \
0     dyer    William     Dyer      619     dyer   rad     9.82      619
1     dyer    William     Dyer      619     dyer   sal     0.13      619
2     dyer    William     Dyer      622     dyer   rad     7.80      622
3     dyer    William     Dyer      622     dyer   sal     0.09      622
4       pb      Frank  Pabodie      734       pb   rad     8.41      734
5       pb      Frank  Pabodie      734       pb  temp   -21.50      734
6       pb      Frank  Pabodie      735       pb   rad     7.22      735
7       pb      Frank  Pabodie      751       pb   rad     4.35      751
8       pb      Frank  Pabodie      751       pb  temp   -18.50      751
9     lake   Anderson     Lake      734     lake   sal     0.05      734
10    lake   Anderson     Lake      751     lake   sal     0.10      751
11    lake   Anderson     Lake      752     lake   rad     2.19      752
12    lake   Anderson     Lake      752     lake   sal     0.09      752
13    lake   Anderson     Lake      752     lake  temp   -16.00      752
14    lake   Anderson     Lake      837     lake   rad     1.46      837
15    lake   Anderson     Lake      837     lake   sal     0.21      837
16     roe  Valentina  Roerich      752      roe   sal    41.60      752
17     roe  Valentina  Roerich      837      roe   sal    22.50      837
18     roe  Valentina  Roerich      844      roe   rad    11.25      844

     site       dated  taken_y person_y
0    DR-1  1927-02-08      619     dyer
1    DR-1  1927-02-08      619     dyer
2    DR-1  1927-02-10      622     dyer
3    DR-1  1927-02-10      622     dyer
4    DR-3  1939-01-07      734       pb
5    DR-3  1939-01-07      734       pb
6    DR-3  1930-01-12      735       pb
7    DR-3  1930-02-26      751       pb
8    DR-3  1930-02-26      751       pb
9    DR-3  1939-01-07      734     lake
10   DR-3  1930-02-26      751     lake
11   DR-3         NaN      752     lake
12   DR-3         NaN      752     lake
13   DR-3         NaN      752     lake
14  MSK-4  1932-01-14      837     lake
15  MSK-4  1932-01-14      837     lake
16   DR-3         NaN      752      roe
17  MSK-4  1932-01-14      837      roe
18   DR-1  1932-03-22      844      roe